Revit 2027 API
DoorEvacuationExitType Enumeration
 An enumerated type listing the possible door evacuation types
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DoorEvacuationExitType
Public Enumeration DoorEvacuationExitType
public enum class DoorEvacuationExitType
type DoorEvacuationExitType
Members
Member name | Value | Description
ExteriorExit | 0 |  Exterior exit door.
InteriorExit | 1 |  Interior exit door.
InteriorPassage | 2 |  Interior passage door.
None | 3 |  Not used for exit access.
See Also
Reference
Autodesk.Revit.DB Namespace